<a href="https://colab.research.google.com/github/Noman-Nosher/Data-Science-Tasks/blob/main/Data_wrangling_day2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [43]:
import pandas as pd

In [44]:
df = pd.read_csv("/content/titanic.csv")

In [4]:
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [ ]:
df

In [6]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [7]:
# "shape" is an attribute of the dataframe and not a function of the method of the dataframe object
print(df.shape)

(891, 12)

In [8]:
print(df.shape()) # not callable as shape is attribute of dataframe object, not function

TypeError: ignored

In [10]:
print(df.columns)# columns is also an attribute like shape attribute

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [12]:
print(df.dtypes) # each column series has to be the same type (not mixed)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [17]:
# subbsetting (lets print contents of the dataframe we have loaded above)
print(df.head()) #head is function(method) not attribute as it includes "()" paranthesis
print("............................................")
print("tail of the dataframe")
print(".............................................")
print(df.tail())

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]
............................................
tail of the dataframe
.............................................
     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [19]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [25]:
# retreiving specific columns from the dataframe object
subset = df[["PassengerId","Survived"]]# python list of specified columns is given between square brackets
columns = ["Parch","Ticket","Fare"]
subset1 = df[columns]
print(subset1.head())

   Parch            Ticket     Fare
0      0         A/5 21171   7.2500
1      0          PC 17599  71.2833
2      0  STON/O2. 3101282   7.9250
3      0            113803  53.1000
4      0            373450   8.0500

In [26]:
subset1.tail()

     Parch      Ticket   Fare
886      0      211536  13.00
887      0      112053  30.00
888      2  W./C. 6607  23.45
889      0      111369  30.00
890      0      370376   7.75

In [31]:
# subsetting can also be done by only specifying the column index

subset2 = df[[1,2]]

KeyError: ignored

In [32]:
#subset using "loc" and "iloc" method (indexex,row_name, both)
print(df.loc[0]) #first row of dataset

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [37]:
df.loc[[0,2,3]] # list of rows indices can be passed

   PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
0            1         0       3  ...   7.250   NaN         S
2            3         1       3  ...   7.925   NaN         S
3            4         1       1  ...  53.100  C123         S

[3 rows x 12 columns]

In [38]:
# iloc,loc and ix methods have ability to subset rows and columns simultaneously
print(df.loc[32])

PassengerId                          33
Survived                              1
Pclass                                3
Name           Glynn, Miss. Mary Agatha
Sex                              female
Age                                 NaN
SibSp                                 0
Parch                                 0
Ticket                           335677
Fare                               7.75
Cabin                               NaN
Embarked                              Q
Name: 32, dtype: object

In [41]:
# df.iloc[:, integer]
#                     .ix is deprecated
# By the way, df.loc[:,'col_header'] is for str or Boolean indexing
print(df.loc[32,'Fare'])
print(df.iloc[32,2])

7.75
3

In [68]:
# multiple rows and columns
rows = [0,2,3]
cols = [0,2,3]
print(df.iloc[rows,cols])
df.ix[rows,cols]

   PassengerId  Pclass                                          Name
0            1       3                       Braund, Mr. Owen Harris
2            3       3                        Heikkinen, Miss. Laina
3            4       1  Futrelle, Mrs. Jacques Heath (Lily May Peel)

AttributeError: ignored

In [46]:
# split apply combine()
# groupby referred as aggregations
df1 = df.groupby("Age")

In [47]:
df1

In [54]:
# count all the passenger ids 
df1.PassengerId.count().tail() # 2 passengers of age 2 years

Age
70.0    2
70.5    1
71.0    2
74.0    1
80.0    1
Name: PassengerId, dtype: int64

In [55]:
df.groupby('Pclass')['Survived'].mean() # average survival in 3 classes

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [56]:
df.groupby('Pclass')['Age'].mean() # average age in 3 classes

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [57]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [66]:
df.groupby('Parch')['PassengerId'].mean() # how many average passengers to each parch value
df.groupby('Survived')["Fare"].count()

Survived
0    549
1    342
Name: Fare, dtype: int64

In [67]:
# groupby frequency count
df.groupby('Age')['Sex'].nunique()

Age
0.42     1
0.67     1
0.75     1
0.83     1
0.92     1
        ..
70.00    1
70.50    1
71.00    1
74.00    1
80.00    1
Name: Sex, Length: 88, dtype: int64